#include "led_beep.h"


/*==================================================================================
* 函 数 名： open_box_power
* 参    数： None
* 功能描述:  打开box电源
* 返 回 值： None
* 备    注： None
* 作    者： xiaozh
* 创建时间： 2019-10-18 160210
==================================================================================*/
uint8_t open_box_power(uint8_t index)
{
	GPIOA->BSRR = index;
	return 0x01;
}

/*==================================================================================
* 函 数 名： close_box_power
* 参    数： None
* 功能描述:  关闭box电源
* 返 回 值： None
* 备    注： None
* 作    者： xiaozh
* 创建时间： 2019-10-18 160222
==================================================================================*/
uint8_t close_box_power(uint8_t index)
{
	GPIOA->BRR = index;
	return 0x01;
}

/*==================================================================================
* 函 数 名： set_beep_state
* 参    数： None
* 功能描述:  设置蜂鸣器状态
* 返 回 值： None
* 备    注： None
* 作    者： xiaozh
* 创建时间： 2019-09-18 120139
==================================================================================*/
void set_beep_state( uint8_t type)
{
 
}

/*==================================================================================
* 函 数 名： set_led_state
* 参    数： None
* 功能描述:  设置led灯状态
* 返 回 值： None
* 备    注： None
* 作    者： xiaozh
* 创建时间： 2019-09-18 120135
==================================================================================*/
void set_led_state(uint8_t type)
{
	 
}

